Revit 2027 API
ExternalResourceBrowserData.GetSubFoldersData Method
 Gets the subfolders data under the folder path of the browser data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExternalResourceSubFolder> GetSubFoldersData()
Public Function GetSubFoldersData As IList(Of ExternalResourceSubFolder)
public:
IList<ExternalResourceSubFolder^>^ GetSubFoldersData()
member GetSubFoldersData : unit -> IList<ExternalResourceSubFolder>
Return Value
IList<ExternalResourceSubFolder>
 The subfolders data under folder path of the browser data.
See Also
Reference
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace